2019/5. Май/Регистры накопления. Агрегаты в оборотных регистрах/src/DataProcessors/СозданиеДокументовПриходаИРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>СозданиеДокументовПриходаИРасхода</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

2019/5. Май/Регистры накопления. Агрегаты в оборотных регистрах/src/Documents/РасходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РасходныйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

2019/5. Май/Регистры накопления. Агрегаты в оборотных регистрах/src/DataProcessors/СозданиеДокументовПриходаИРасхода/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ВсегоСекунд = Период.ДатаОкончания - Период.ДатаНачала;
	ВсегоДней = Цел(ВсегоСекунд / 86400)+1;
	
	ПериодОтсчета = Период.ДатаНачала;
	
	Прогресс = 0;
	Элементы.Прогресс.МаксимальноеЗначение = ВсегоДней;
	НоменклатураСписок.Очистить();
	ТеукущийДень = "";        
	
	Для Сч = 0 По ВсегоДней Цикл
		ОбработкаПрерыванияПользователя();
		
		ДатаДокументов = ПериодОтсчета + 86400*Сч;
		
		ТеукущийДень = Формат(ДатаДокументов,"ДЛФ=DD");
		
    	СоздатьДокументыСервер(ДатаДокументов);
		Прогресс = Прогресс + 1;
		
		ЭтаФорма.ОбновитьОтображениеДанных();
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;	   	
	
	ТеукущийДень = "";
	Прогресс = 0;
	НоменклатураСписок.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСервер(ДатаДокументов)
	             	
	Если НоменклатураСписок.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";   
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = НоменклатураСписок.Добавить();
			НовСтр.Ссылка = Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	
	Для i = 1 По КоличествоДокументов Цикл
		Для СчДок = 1 По 3 Цикл
			НовПриход = Документы.ПриходныйОрдер.СоздатьДокумент();
			НовПриход.Дата = НачалоДня(ДатаДокументов)+СчДок;
			НовПриход.Склад = Справочники.Склады.НайтиПоКоду("00000000"+СчДок);
			Для Каждого Стр Из НоменклатураСписок Цикл
				НовСтр = НовПриход.Товары.Добавить();
				НовСтр.Номенклатура = Стр.Ссылка;
				НовСтр.Количество = ГСЧ.СлучайноеЧисло(1,5);
			КонецЦикла;
			НовПриход.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;   				
		
		Для СчДок = 1 По 3 Цикл
			НовРасход = Документы.РасходныйОрдер.СоздатьДокумент();
			НовРасход.Дата = КонецДня(ДатаДокументов)-СчДок;
			НовРасход.Склад = Справочники.Склады.НайтиПоКоду("00000000"+СчДок);
			Для Каждого Стр Из НоменклатураСписок Цикл
				НовСтр = НовРасход.Товары.Добавить();
				НовСтр.Номенклатура = Стр.Ссылка;
				НовСтр.Количество = ГСЧ.СлучайноеЧисло(1,5);
			КонецЦикла;
			НовРасход.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоДокументов = 100;
КонецПроцедуры
